### **Import Library**

In [1]:
import numpy as np
import os
import pandas as pd
import seaborn as sns
from scipy.stats import entropy
import matplotlib.pyplot as plt
from tqdm import tqdm

%matplotlib notebook
plt.style.use('../test/deeplearning.mplstyle')

### **Import Dataset**

In [2]:
ROOT_DIR = os.path.dirname(os.getcwd())
DATA_DIR = os.path.join(ROOT_DIR, "data")
DATASET_PATH = os.path.join(DATA_DIR, "housing.csv")

In [3]:
housing_dataset = pd.read_csv(DATASET_PATH)
housing_dataset.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [4]:
housing_dataset.columns

Index(['price', 'area', 'bedrooms', 'bathrooms', 'stories', 'mainroad',
       'guestroom', 'basement', 'hotwaterheating', 'airconditioning',
       'parking', 'prefarea', 'furnishingstatus'],
      dtype='object')

In [5]:
housing_dataset = housing_dataset[['area', 'price']]
housing_dataset

     area     price
0    7420  13300000
1    8960  12250000
2    9960  12250000
3    7500  12215000
4    7420  11410000
..    ...       ...
540  3000   1820000
541  2400   1767150
542  3620   1750000
543  2910   1750000
544  3850   1750000

[545 rows x 2 columns]

### **Normalize the Dataset**

In [6]:
mean = np.array(housing_dataset.mean())
std = np.array(housing_dataset.std())
print(mean)
print(std)

housing_dataset = (housing_dataset - mean)/std
housing_dataset.head()

[   5150.5412844  4766729.24770642]
[   2170.14102251 1870439.61565739]

       area     price
0  1.045766  4.562174
1  1.755397  4.000809
2  2.216196  4.000809
3  1.082630  3.982096
4  1.045766  3.551716